---
description: Meta-predicados. Aritm√©tica, Instru√ß√µes de Escrita e Leitura, Estruturas.
---

# Meta-Predicados, Arim√©tica, IO, Estruturas

Informa√ß√£o √∫til para perceberem o que est√° a acontecer na recurs√£o: podem escrever `trace.` na prompt, e l√° dentro escrever o objetivo pretendido. Ao carregar `Enter` repetidamente, podemos observar a recurs√£o a acontecer (obrigado Gon√ßalo Mateus üòÉ).

[[toc]]

## Meta-Predicados sobre Listas

Ponto importante - sempre que virem algo do g√©nero `<nome_func>/<numero>`, `<numero>` √© o n√∫mero de argumentos que a fun√ß√£o recebe.

### length

[Predicado built-in](https://github.com/dtonhofer/prolog_notes/tree/master/swipl_notes/about_length) que recebe dois argumentos, uma lista e uma vari√°vel, e\
 devolve `<vari√°vel> = <comprimento>`.

```prolog
% Exemplo de intera√ß√£o
?- length([1,2,3,4,5], L).
L = 5.
```

### append

Recebe dois ou tr√™s argumentos, uma ou duas listas e uma vari√°vel. Permite intera√ß√µes como as demonstradas abaixo:

```prolog
% intera√ß√µes com append
?- append([1,2,3], [4,5], X).
X = [1,2,3,4,5].
% podemos ainda dar append a mais que 2 listas:
?- append([[1,2],[3,4], [5,6]], X).
X = [1,2,3,4,5,6].
?- append([[1,2], X, [a,b,c]], [1,2,3,4,5,a,b,c]).
X = [3,4,5].
?- append(X, [Ultimo], [1,2,3]).
X = [1,2],
Ultimo = 3.
?- append([1,2,3], Resto, L).
L = [1,2,3 | Resto].
```

### maplist

O [maplist](https://github.com/dtonhofer/prolog_notes/blob/master/swipl_notes/about_maplist/maplist_2_examples.md) √© um predicado _built-in_ com enormes semelhan√ßas ao `map` do Python, onde, ao dar-lhe uma fun√ß√£o como argumento, retornava o resultado da aplica√ß√£o dessa fun√ß√£o aos elementos da lista argumento. No `maplist` do Prolog passa-se algo do mesmo g√©nero. Ocorre em 4 variantes, `maplist/2`, `maplist/3`, `maplist/4` e `maplist/5`, correspondendo os n√∫meros √† quantidade de argumentos que aceita (ao chamar a fun√ß√£o, n√£o usamos esta nota√ß√£o, apenas usamos `maplist`). O primeiro argumento √© **sempre** a fun√ß√£o/predicado que queremos utilizar, e os seguintes as listas que queremos que sejam operadas pela fun√ß√£o.

**Pormenores importantes** - nos `maplist` que aceitam mais que uma lista, todas as listas devem ser do mesmo tamanho; as listas devem ter tamanhos definidos.

O √∫ltimo pormenor pode ser reproduzido atrav√©s de:

```prolog
% programa:
just_one(1).

% intera√ß√£o
?- maplist(just_one, E).
E = []; % temos de carregar no ; para ver os resultados a aparecer
E = [1];
E = [1,1];
...

% esta intera√ß√£o nunca "para", o que √© oposto ao que queremos - uma resposta concisa
```

Exemplos de intera√ß√µes corretas:

```prolog
% maplist/2 - chama o predicado e
% verifica se o predicado √© verdadeiro para cada elemento da lista

?- maplist(atom, [a, b, c]).
true.
? maplist(nonvar, [X, 1, P]).
false.
% par(N) - N √© par
?- maplist(par, [1,2,3,4]).
false.

% dobro(X, Y) - Y √© o dobro de X
?- maplist(dobro, [1,2,3,4,5], L).
L = [2,4,6,8,10].

% soma(X, Y, Z) - Z √© a soma de X com Y
?- maplist(soma, [1,2,3,4,5], [1,2,3,4,5], L).
L = [2,4,6,8,10].
?- maplist(soma(10), [1,2,3,4,5], L).
L = [11,12,13,14,15].
```

### include, exclude

Os meta-predicados `include` e `exclude` funcionam, tal como o nome indica, de maneiras diretamente opostas. Ambos recebem 3 argumentos, sendo o primeiro o predicado "filtrador", o segundo a lista que queremos filtrar e a terceira a lista devolvida ap√≥s o filtro estar conclu√≠do.

```prolog
% programa
is_odd(I) :- 0 =\= I mod 2.
% ir√° ser abordado mais √† frente, mas =\= √© "valores de express√µes diferentes" e mod √© o resto
are_identical(X, Y) :- X == Y.
count_vars(L, Res) :- include(var, L, L_vars), length(L_vars, Res).

% intera√ß√£o
?- include(is_odd, [1,2,3,4,5,6], Odd).
Odd = [1,3,5].
?- exclude(is_odd, [1,2,3,4,5,6], Even).
Even = [2,4,6].
?- exclude(are_identical(3), [1,2,3,4,3,2,1], L).
L = [1,2,4,2,1].
% podemos escrever o objetivo acima de outra maneira, mais interessante
?- exclude(=(3), [1,2,3,4,3,2,1], L).
L = [1,2,4,2,1].
% opera√ß√µes semelhantes ocorrem ao alterar o = por <, >, ...
?- count_vars([1,2,4,X,Y,p, A], L).
L = 3.
```

### findall, setof

O `findall` e o `setof` t√™m estruturas semelhantes:

```prolog
findall(<termo>, <objetivo>, <lista>).
setof(<termo>, <objetivo>, <lista>).
```

Ambos funcionam de modo semelhante, `<lista>` vai ter os termos que satisfa√ßam `<objetivo>`. Contudo, `<lista>` em `findall` pode conter elementos repetidos, enquanto que em `setof` isso n√£o ocorre.
Aqui vale a pena tamb√©m notar que `member/2` recebe um termo e uma lista e devolve um booleano que representa o termo estar presente na lista ou n√£o.

Intera√ß√µes poss√≠veis seriam, por exemplo:

```prolog
?- findall(X, (member(X, [6,2,4,5,4,7]), X mod 2 =:= 0), L).
L = [6,2,4,4].
?- setof(X, (member(X, [6,2,4,5,4,7]), X mod 2 =:= 0), L).
L = [6,2,4].
```

Intera√ß√£o mais complexa, **√∫til para o projeto** segundo a prof.:

```prolog
% sublist(SL, L, N) - SL √© uma sublista de L de comprimento N
sublist(SL, L, N) :- append([_, SL, _], L), length(SL, N).

?- L = [1,2,3,4,5,6], sublist(SL, L, 4).
L = [1, 2, 3, 4, 5, 6],
SL = [1, 2, 3, 4]
L = [1, 2, 3, 4, 5, 6],
SL = [2, 3, 4, 5]
L = [1, 2, 3, 4, 5, 6],
SL = [3, 4, 5, 6]
false.
```

No programa acima, podemos ler `append([_, SL, _], L)`, que √© algo como "SL √© uma sublista de L, onde ambos os `_` s√£o o que vem (ou n√£o) atr√°s e √† frente de SL em L, mas que n√£o nos interessa". Como queremos todas as sublistas de L de comprimento `N`, primeiro √© devolvida a resposta com os 4 primeiros elementos, de seguida com os elementos de 1 a 5 e por fim com os √∫ltimos 4 elementos.

Podemos, ainda, querer uma lista com todas as sublistas - aqui entra o `findall`:

```prolog
sublists(L, N, SLs) :- findall(SL, sublist(SL, L, N), SLs).
% aqui, SLs √© uma lista com todas as sublistas pretendidas.

?- L = [1,2,3,4,5,6], sublists(L, 4, SLs).
L = [1,2,3,4,5,6],
SLs = [[1, 2, 3, 4], [2, 3, 4, 5], [3, 4, 5, 6]].
```

Esta implementa√ß√£o tem, contudo, um problema, problema este que segundo a prof est√° **diretamente relacionado com o projeto**.

```prolog
% caso fa√ßamos:
?- L = [V1,V2,V3,V4,V5,V6], sublists(L, 4, SLs).
% o que √© devolvido √©
L = [V1,V2,V3,V4,V5,V6],
SLs = [[_1056, _1062, _1068, _1074], [_1026, _1032, _1038, _1044], [_996, _1002, _1008, _1014]].
% que n√£o √© o que quer√≠amos (quer√≠amos uma lista cujas sublistas incluem as vari√°veis Vn)
% dependendo da aplica√ß√£o, pode ser irrelevante - no projeto interessa
% porque √© que isto acontece? "n√£o me perguntes porque √© que faz, mas faz" - prof.
```

Como √© que podemos solucionar isto? Utilizando o `bagof`, que faz algo muito semelhante ao `findall`, com a particularidade de no caso de termos uma lista com vari√°veis, as vari√°veis (para este prop√≥sito) serem tratadas como queremos aqui:

```prolog
% a diferen√ßa entre programas √© exclusivamente usar bagof em vez de findall
?- L = [V1,V2,V3,V4,V5,V6], sublistas(L, 4, SLs).
L = [V1, V2, V3, V4, V5, V6],
SLs = [[V1, V2, V3, V4], [V2, V3, V4, V5], [V3, V4, V5, V6]].

% temos ainda que sublistas de tamanho maior que o comprimento de L retornam false
?- L = [V1,V2,V3,V4,V5,V6], sublistas(L, 7, SLs).
false.
% que pode ser um problema, caso quis√©ssemos, aqui, uma lista vazia em vez de false

% como resolver o problema? adicionar uma cl√°usula ao programa:
sublists(_, _, []).
% para al√©m disso, adicionar `!` (cuja utilidade ser√° explicada √† frente) √† cl√°usula original:
sublists(L, N, SLs) :- bagof(SL, sublista(SL, L, N), SLs), !.
% de notar que a cl√°usula que vem primeiro √© esta √∫ltima, s√≥ depois √© que vem a cl√°usula que adicion√°mos
```

Aqui, a utilidade do operador de corte √©: "se isto n√£o der falso, n√£o uses mais cl√°usula nenhuma; se der, continua e usa o que vem a seguir".

"Estes slides s√£o uma _receita_ para o vosso projeto, para quando quiserem fazer uma coisa semelhante" - prof.

## Aritm√©tica

De seguida est√£o apresentadas algumas opera√ß√µes aritm√©ticas que podem ser √∫teis:

| Opera√ß√£o                         | Significado                          |
| -------------------------------- | ------------------------------------ |
| A+B, +(A, B)                     | soma entre A e B                     |
| A-B, -(A, B)                     | diferen√ßa entre A e B                |
| A*B, *(A, B)                     | produto entre A e B                  |
| A/B, /(A, B)                     | quociente real entre A e B           |
| A//B, //(A,B)                    | quociente inteiro entre A e B        |
| A^B, ^(A, B), A\*\*B, \*\*(A, B) | A elevado a B                        |
| -A                               | sim√©trico de A                       |
| sin(A), cos(A), tan(A)           | seno, cosseno, tangente de A         |
| log(A)                           | logaritmo natural de A               |
| abs(A)                           | m√≥dulo de A                          |
| sqrt(A)                          | raiz quadrada de A                   |
| max(A, B)                        | maior valor entre A e B              |
| min(A, B)                        | menor valor entre A e B              |
| rem(A, B), mod(A, B)             | resto da divis√£o entre A e B         |
| gcd(A, B)                        | maior divisor comum entre A e B      |
| lcm(A, B)                        | menor m√∫ltiplo comum entre A e B     |
| sign(A)                          | -1 se A < 0, 0 se A == 0, 1 se A > 0 |
| random(A)                        | valor tal que 0 <= valor < A         |
| random_between(A, B)             | valor tal que A <= valor <= B        |
| round(A)                         | arredonda (para o int + pr√≥ximo) A   |
| floor/ceiling/float/integer      | voc√™s sabem estes                    |
| >>, <<, xor                      | shift left, right, xor               |
| \\/                              | bitwise or (cursed)                  |
| /\                               | bitwise and (cursed)                 |

Temos tamb√©m opera√ß√µes relacionais:

| Opera√ß√£o       | Significado                                              |
| -------------- | -------------------------------------------------------- |
| >, <, >=, =<   | voc√™s conhecem estas                                     |
| A = B          | true caso A e B unifiquem                                |
| A \\= B        | true caso A e B n√£o unifiquem                            |
| A == B         | true caso A e B forem a mesma coisa                      |
| A \\== B       | true caso A e B n√£o sejam a mesma coisa                  |
| Exp1 =:= Exp2  | true caso o valor de Exp1 seja o mesmo que o de Exp2     |
| Exp1 =\\= Exp2 | true caso o valor de Exp1 n√£o seja o mesmo que o de Exp2 |

De real√ßar que ainda h√° uma varia√ß√£o de `>, <, >=, =<`, com `@` antes do operador, que funciona como uma esp√©cie de `strcmp`, ou seja, compara dois termos alfabeticamente. Podemos observar uma intera√ß√£o poss√≠vel no exemplo abaixo:

```prolog
?- likes(mary, pizza) @< likes(mary, plums).
true.
```

::: details Exemplos de Intera√ß√µes com as opera√ß√µes acima

```prolog
?- X = +(2, 3).
X = 2+3.
?- 2 + X = Y + 3.
X = 3,
Y = 2.
?- 3 + 5 = 5 + 3.
false.
?- 3 + 5 =:= 5 + 3.
true.
?- X = 9, X + 1 = 10.
false.
?- X = 9, X + 1 == +(9,1).
X = 9.
?- X = 9, X + 1 =:= 10.
X = 9.
```

:::

Temos ainda o `is`, onde primeiro √© avaliada a express√£o da direita e depois h√° a tentativa de unifica√ß√£o com o termo da esquerda.

```prolog
% (equivalente a ?- a = 8.)
?- a is 6 + 2.
false.
% (equivalente a ?- 6 + 2 = 8.)
?- 6 + 2 is 6 + 2.
false.
% (equivalente a ?- s(8) = 8.)
?- s(8) is 6 + 2.
false.
% (equivalente a ?- X = 8.)
?- X is 6 + 2.
X = 8.
?- X is 6 + 2, Y is X ** 2.
X = 8,
Y = 64.
```

Cria√ß√£o do predicado pot√™ncia, equivalente √† opera√ß√£o `**`:

```prolog
% potencia(B, E, P) - B elevado a E √© P

% qualquer coisa elevada a 0 √© 1
potencia(_, 0, 1).

%  caso contr√°rio:
potencia(B, E, P) :-
  E > 0,
  NextE is E - 1,
  potencia(B, NextE, NextRes),
  P is B*NextRes.
```

## Leitura/Escrita

O Prolog, tal como as outras linguagens de programa√ß√£o, tamb√©m apresenta instru√ß√µes de leitura e escrita de dados, instru√ß√µes estas que correspondem a predicados.

### Instru√ß√µes de Leitura

Utilizamos, para leitura, o predicado `read/1`, que unifica o termo escrito como input com o termo argumento. Para al√©m de na _prompt_ termos de utilizar o ponto final, temos de o escrever tamb√©m no input.

Intera√ß√µes b√°sicas:

```prolog
?- read(a).
|: a.
true.
?- read(a).
|: b.
false.
?- X = 5, read(X).
|: 3+2.
false.
?- X = +(3,2), read(X).
|: 3+2.
X = 3+2.
?- read(X).
|: 3 mais 2.
ERROR: Stream user_input:0:72 Syntax error:Operator expected
?- read(X).
|: mais(3,2).
X = mais(3, 2).
```

**Um objetivo que utilize o predicado read s√≥ tem sucesso uma vez, isto √©, qualquer tentativa posterior ser√° falhada**.

```prolog
% par(X) - X √© par.
par(X) :- X mod 2 =:= 0.
% le_e_verifica_par - o n√∫mero lido √© par.
le_e_verifica_par :- read(X), par(X).

?- par(8).
true.
?- le_e_verifica_par.
|: 5.
false.
?- le_e_verifica_par.
|: 6.
true.
```

### Instru√ß√µes de escrita

Temos, para efeitos de escrita, tr√™s predicados pr√©-definidos: `write/1`, que escreve o valor do seu argumento e **n√£o muda de linha**, `writeln/1` que escreve o valor do seu argumento **e muda de linha** e `nl/0` que muda de linha.

Intera√ß√µes b√°sicas:

```prolog
?- write(a),write(5).
a5
true.
?- writeln(a),write(5).
a
5.
true.
?- write(a),nl,write(5).
a
5.
true.
?- read(X),writeln(X + 5).
|: 2.
2+5
X = 2.
?- read(X),Y is X + 5,writeln(Y).
|: 2.
7
X = 2,
Y = 7.
```

## Estruturas

J√° vimos anteriormente v√°rios tipos elementares de dados - √°tomos, n√∫meros, vari√°veis, etc.. Contudo, podemos ainda combinar tipos de dados elementares para construir tipos de dados mais complexos, estruturados. Em Prolog, represent√°-los-emos atrav√©s de termos compostos, sendo estes considerados **estruturas**.

De volta aos velhinhos TADs, sabemos que um tipo de dados tem, por norma, de ter definidos construtores, seletores, reconhecedores e testes.

Tentemos criar uma estrutura chamada `data`. Essa estrutura poder√° ter, por ex., um construtor, `faz_data` e seletores, `ano_de`, `mes_de` e `dia_de`. Em termos abstratos, podemos considerar a `data` como um termo de tr√™s argumentos, onde `data` √© uma esp√©cie de `functor`. Assim sendo, a estrutura poder√° ser algo do g√©nero `data(A, M, D)`, cujos ano, m√™s e dia s√£o, respetivamente, A, M e D. Com base nesta ideia, podemos construir alguns predicados:

```prolog
% construtor
faz_data(A, M, D, data(A, M, D)).

% seletores
% para cada seletor, s√≥ nos interessa um "atributo", pelo que o resto pode ser
% representado por uma vari√°vel an√≥nima
ano_de(data(A, _, _), A).
mes_de(data(_, M, _), M).
dia_de(data(_, _, D), D).

% podemos ainda definir alguns modificadores
% o atributo atual √© irrelevante dado que o queremos mudar, pelo que pode
% ser representada por uma vari√°vel an√≥nima
muda_ano(A, data(_, M, D), data(A, M, D)).
muda_mes(M, data(A, _, D), data(A, M, D)).
muda_dia(D, data(A, M, _), data(A, M, D)).
```

Ora, tal como em FP, a utilidade dos TADs por si s√≥ n√£o se cinge aos tipos em concreto, mas sim aos programas que com eles podemos criar. No exemplo seguinte, podemos ver precisamente um exemplo disso mesmo, onde utilizamos os TADs definidos anteriormente para alterar uma data:

```prolog
% prox_ano(Hoje, Futuro) - data equivalente a hoje do pr√≥ximo ano

prox_ano(Hoje, Futuro) :-
  ano_de(Hoje, A),
  NextYear is A + 1,
  muda_ano(NextYear, Hoje, Futuro).

% intera√ß√£o poss√≠vel:

?- prox_ano(faz_data(2014, 4, 2), Futuro).
Futuro = data(2015, 4, 2).
```

Nos slides h√° um exemplo giro do problema do homem, do lobo, da cabra e da couve, e no livro h√° um semelhante mas sobre tr√™s casas coloridas se quiserem ver mais coisas deste g√©nero.

::: tip
Para correr c√≥digo de dentro de um programa rapidamente sem criar um ficheiro, pode-se escrever `[user].` na prompt, seguido do c√≥digo para p√¥r dentro do programa, seguido de Ctrl-D (EOF).
:::

[Slides (Meta-Predicados)](https://drive.google.com/file/d/1fXdFS_m-H_e_gx_EtxJltQjvD9h4GN9_/view?usp=sharing)
[Slides (Aritm√©tica, IO, Estruturas)](https://drive.google.com/file/d/1dH3f2Wq-ApjzpY835TxG5fNucu7eQ9E7/view?usp=sharing)
